#### Terraform Plan 📝`failure`

Monthly cost estimate: 0 USD

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.aws_basic_network.aws_cloudwatch_log_group.vpc_flow_log_group will be created
  + resource "aws_cloudwatch_log_group" "vpc_flow_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vpc/flow-logs/staging"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-vpc-flow-logs"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + tags_all          = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-vpc-flow-logs"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
    }

  # module.aws_basic_network.aws_eip.elastic_ip["ca-central-1a"] will be created
  + resource "aws_eip" "elastic_ip" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1a-nat-ip"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + tags_all             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1a-nat-ip"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + vpc                  = (known after apply)
    }

  # module.aws_basic_network.aws_eip.elastic_ip["ca-central-1b"] will be created
  + resource "aws_eip" "elastic_ip" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1b-nat-ip"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + tags_all             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1b-nat-ip"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + vpc                  = (known after apply)
    }

  # module.aws_basic_network.aws_eip.elastic_ip["ca-central-1c"] will be created
  + resource "aws_eip" "elastic_ip" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1c-nat-ip"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + tags_all             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1c-nat-ip"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + vpc                  = (known after apply)
    }

  # module.aws_basic_network.aws_internet_gateway.internet_gateway will be created
  + resource "aws_internet_gateway" "internet_gateway" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-igw"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + tags_all = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-igw"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + vpc_id   = (known after apply)
    }

  # module.aws_basic_network.aws_nat_gateway.nat_gateway["ca-central-1a"] will be created
  + resource "aws_nat_gateway" "nat_gateway" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1a-nat-gw"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1a-nat-gw"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
    }

  # module.aws_basic_network.aws_nat_gateway.nat_gateway["ca-central-1b"] will be created
  + resource "aws_nat_gateway" "nat_gateway" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1b-nat-gw"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1b-nat-gw"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
    }

  # module.aws_basic_network.aws_nat_gateway.nat_gateway["ca-central-1c"] will be created
  + resource "aws_nat_gateway" "nat_gateway" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1c-nat-gw"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1c-nat-gw"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
    }

  # module.aws_basic_network.aws_route_table.private_route_table["ca-central-1a"] will be created
  + resource "aws_route_table" "private_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1a-private-route-table"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1a-private-route-table"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_basic_network.aws_route_table.private_route_table["ca-central-1b"] will be created
  + resource "aws_route_table" "private_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1b-private-route-table"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1b-private-route-table"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_basic_network.aws_route_table.private_route_table["ca-central-1c"] will be created
  + resource "aws_route_table" "private_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1c-private-route-table"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1c-private-route-table"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_basic_network.aws_route_table.public_route_table will be created
  + resource "aws_route_table" "public_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-public-route-table"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-public-route-table"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_basic_network.aws_route_table_association.private_route_table_association["ca-central-1a"] will be created
  + resource "aws_route_table_association" "private_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_basic_network.aws_route_table_association.private_route_table_association["ca-central-1b"] will be created
  + resource "aws_route_table_association" "private_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_basic_network.aws_route_table_association.private_route_table_association["ca-central-1c"] will be created
  + resource "aws_route_table_association" "private_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_basic_network.aws_route_table_association.public_route_table_association["ca-central-1a"] will be created
  + resource "aws_route_table_association" "public_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_basic_network.aws_route_table_association.public_route_table_association["ca-central-1b"] will be created
  + resource "aws_route_table_association" "public_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_basic_network.aws_route_table_association.public_route_table_association["ca-central-1c"] will be created
  + resource "aws_route_table_association" "public_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_basic_network.aws_subnet.private_subnet["ca-central-1a"] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.21.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1a-private-subnet"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + tags_all                                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1a-private-subnet"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.aws_basic_network.aws_subnet.private_subnet["ca-central-1b"] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.22.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1b-private-subnet"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + tags_all                                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1b-private-subnet"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.aws_basic_network.aws_subnet.private_subnet["ca-central-1c"] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.23.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1c-private-subnet"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + tags_all                                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1c-private-subnet"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.aws_basic_network.aws_subnet.public_subnet["ca-central-1a"] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1a-public-subnet"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + tags_all                                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1a-public-subnet"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.aws_basic_network.aws_subnet.public_subnet["ca-central-1b"] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1b-public-subnet"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + tags_all                                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1b-public-subnet"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.aws_basic_network.aws_subnet.public_subnet["ca-central-1c"] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.13.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1c-public-subnet"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + tags_all                                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ca-central-1c-public-subnet"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.aws_basic_network.aws_vpc.network_vpc will be created
  + resource "aws_vpc" "network_vpc" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = true
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-vpc"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
      + tags_all                             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-vpc"
          + "Project"     = "exp-net-fundatmentals"
          + "Region"      = "ca-central-1"
        }
    }

Plan: 25 to add, 0 to change, 0 to destroy.

```

</details>